#!/data/data/com.termux/files/usr/bin/bash

clear

echo "=============================================================="
echo "   ███████╗██╗  ██╗███████╗██╗     ██╗      ██████╗██████╗"
echo "   ██╔════╝██║  ██║██╔════╝██║     ██║     ██╔════╝██╔══██╗"
echo "   ███████╗███████║█████╗  ██║     ██║     ██║     ██████╔╝"
echo "   ╚════██║██╔══██║██╔══╝  ██║     ██║     ██║     ██╔══██╗"
echo "   ███████║██║  ██║███████╗███████╗███████╗╚██████╗██║  ██║"
echo "   ╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝ ╚═════╝╚═╝  ╚═╝"
echo
echo "                 ShellCrafter AI Launcher"
echo "=============================================================="
echo
echo " Model : Qwen 3.5 0.8B Q4_K_M"
echo " Engine: llama.cpp"
echo " Mode  : No Thinking"
echo

mkdir -p "$HOME/models"

cd "$HOME/models" || exit 1

llama-cli \
-hf unsloth/Qwen3.5-0.8B-GGUF:Q4_K_M \
--chat-template-kwargs '{"enable_thinking":false}'
